Repository: AngelDTP/Gestion-coleFlutter
Catalog: tpfinal_angel/lib/l10n/intl_*.arb
Languages: fr

source: Login
fr: Connexion

# errorText
source: An error has been found
fr: Une erreur a été rencontré

# error_connection
source: Connection error
fr: Erreur de connexion

# modifTitle
source: Modify your info
fr: Modifiez vos informations

# matricule
source: Registration Number
fr: Matricule

# contraintesMatricule
source: Enter 7 numbers
fr: Entrez 7 chiffres

# nom
source: Last Name
fr: Nom

# contraintesNom
source: Enter a last name
fr: Entrez un nom

# prenom
source: First Name
fr: Prénom

# contraintesPrenom
source: Enter a first name
fr: Entrez un prénom

# role
source: Role (Teacher, Student, Admin)
fr: Role (Enseignant, Etudiant, Administrateur)

# roleConstraints
source: Enter a valid role (Teacher, Student, Admin)
fr: Entrez un role valide (Enseignant, Etudiant, Administrateur)

# modifInfosText
source: Modify infos
fr: Modifier infos

# gestionClassesTitle
source: Class Management
fr: Gestion des classes

# ajouterClasse
source: Add a class
fr: Ajouter une classe

# ajouterPeriodes
source: Add periods
fr: Ajouter des périodes

# ajouterEtudiants
source: Add students
fr: Ajouter des étudiants

# presenceTitle
source: Attendance page
fr: Page de présences

# rechercheTitle
source: Research Page
fr: Pade de recherche

# chercherEtudiant
source: Search student
fr: Chercher étudiant

# etudiantPasTrouve
source: No student found
fr: Aucun étudiant trouvé

# calendrier
source: Calendar
fr: Calendrier

# modifications
source: Modify
fr: Modification

# present
source: Here
fr: Présent

# enregistrerChangements
source: Save Modifications
fr: Enregistrer Changements

# revenir
source: Go back
fr: Revenir

# modeConsultation
source: Consultation Mode
fr: Mode Consultation

# modeModifications
source: Modification mode
fr: Mode modifications

source: No data found
fr: Aucune donnée trouvée

# choisirEnseignant
source: Choose a teacher
fr: Choisissez un enseignant

# nomClasse
source: Class name
fr: Nom de la classe

# nomClasseContraintes
source: Enter a name for this class
fr: Entrez un nom de la classe

# numeroGroupe
source: Group number
fr: Numéro de groupe

# numeroGroupeContraintes
source: Enter a number of the group higher than 0
fr: Entrez un numéro de classe plus haut que 0

# creerClasse
source: Create Class
fr: Créer Classe

# afficherEleves
source: Show Class Students
fr: Afficher les élèves de la classe

# rechercheClasse
source: Search Class
fr: Rechercher Classe

# jour
source: Date
fr: Jour

# jourContraintes
source: Enter a valid date
fr: Entrez une date valide

# heureDebut
source: Starting time
fr: Heure de début

# heureDebutContraintes
source: Enter a valid starting time
fr: Entrez une heure de début valide

# heureFin
source: Finishing time
fr: Heure de fin

# heureFinContraintes
source: Enter a valid finishing time
fr: Entrez une heure de fin valide

# ajouterPeriode
source: Add Period
fr: Ajouter Période

# changerCours
source: Change Class
fr: Changer Cours

# reessayer
source: Not found, Retry
fr: Pas trouvé, Réessayer

# calendrierTitle
source: Scholar Calendar
fr: Calendrier Scolaire

# legendeCouleurs
source: Color legend
fr: Légende des couleurs

# conge
source: Leave
fr: Congé

# jourTP
source: PW day
fr: Journée TP

# dateLimiteAbandon
source: Deadline for abandonment
fr: Date Limite Abandon

# evaluationUniformeFR
source: Uniform French assessment
fr: Évaluation uniforme de français

# evaluationCommune
source: Common assessment
fr: Évaluation commune

# portesOuvertes
source: Open doors event
fr: Évènement Portes Ouvertes

# semaine
source: Week
fr: Semaine

# svpAjoutImage
source: Please add an image
fr: SVP ajoutez une image

# emailContraintes
source: Enter a valid email
fr: Entrez un email valide

# mdp
source: Password
fr: Mot de passe

# mdpContraintes
source: Enter at least 7 caracters
fr: Veuillez entrer au moins 7 caractères

# connexion
source: Log In
fr: Connexion

# inscription
source: Sign in
fr: Inscription

# creerCompte
source: Create an account
fr: Créer un compte

# dejaUnCompte
source: Already have an account
fr: Déjà un compte

# ajouterUneImage
source: Add an image
fr: Ajouter une image
